
export const chinaProvince = [
  {
    name: '北京市',
    code: '北京',
    latlng: [39.91667, 116.41667]
  },
  {
    name: '天津市',
    code: '天津',
    latlng: [39.13333, 117.20000]
  },
  {
    name: '上海市',
    code: '上海',
    latlng: [31.20000, 121.55333]
  },
  {
    name: '重庆市',
    code: '重庆',
    latlng: [29.56667, 106.45000]
  },
  {
    name: '河北省',
    code: '河北',
    latlng: [38.03333, 115.48333]
  },
  {
    name: '山西省',
    code: '山西',
    latlng: [37.86667, 112.53333]
  },
  {
    name: '辽宁省',
    code: '辽宁',
    latlng: [41.80000, 123.38333]
  },
  {
    name: '吉林省',
    code: '吉林',
    latlng: [43.88333, 125.35000]
  },
  {
    name: '黑龙江省 ',
    code: '黑龙江',
    latlng: [47.75000, 127.63333]
  },
  {
    name: '江苏省',
    code: '江苏',
    latlng: [32.05000, 119.78333]
  },
  {
    name: '浙江省',
    code: '浙江',
    latlng: [30.26667, 120.20000]
  },
  {
    name: '安徽省',
    code: '安徽',
    latlng: [31.86119, 117.283042]
  },
  {
    name: '福建省',
    code: '福建',
    latlng: [26.08333, 118.30000]
  },
  {
    name: '江西省',
    code: '江西',
    latlng: [28.68333, 115.90000]
  },
  {
    name: '山东省',
    code: '山东',
    latlng: [36.675807, 117.000923]
  },
  {
    name: '河南省',
    code: '河南',
    latlng: [34.76667, 113.65000]
  },
  {
    name: '湖北省',
    code: '湖北',
    latlng: [30.584355, 114.298572]
  },
  {
    name: '湖南省',
    code: '湖南',
    latlng: [28.21667, 113.00000]
  },
  {
    name: '广东省',
    code: '广东',
    latlng: [23.16667, 113.23333]
  },
  {
    name: '海南省',
    code: '海南',
    latlng: [20.01667, 110.35000]
  },
  {
    name: '四川省',
    code: '四川',
    latlng: [30.66667, 104.06667]
  },
  {
    name: '贵州省',
    code: '贵州',
    latlng: [26.56667, 106.71667]
  },
  {
    name: '云南省',
    code: '云南',
    latlng: [25.05000, 102.73333]
  },
  {
    name: '陕西省',
    code: '陕西',
    latlng: [34.26667, 108.95000]
  },
  {
    name: '甘肃省',
    code: '甘肃',
    latlng: [36.03333, 103.73333]
  },
  {
    name: '青海省',
    code: '青海',
    latlng: [36.56667, 96.75000]
  },
  {
    name: '台湾省',
    code: '台湾',
    latlng: [25.03, 121.30]
  },
  {
    name: '广西壮族自治区',
    code: '广西',
    latlng: [22.82402, 108.320004]
  },
  {
    name: '内蒙古自治区',
    code: '内蒙古',
    latlng: [41.818311, 111.670801]
  },
  {
    name: '西藏自治区',
    code: '西藏',
    latlng: [30.60000, 91.00000]
  },
  {
    name: '宁夏回族自治区',
    code: '宁夏',
    latlng: [37.46667, 106.26667]
  },
  {
    name: '新疆维吾尔自治区',
    code: '新疆',
    latlng: [43.76667, 87.68333]
  },
  {
    name: '香港特别行政区',
    code: '香港',
    latlng: [22.20000, 114.10000]
  },
  {
    name: '澳门特别行政区',
    code: '澳门',
    latlng: [22.20000, 113.50000]
  }
]
